<?php // <==================================================================================================================
// ==================================================> --------------- <====================================================
// ================================================> © Copyright barik  <====> Скрипт обработчик - Регистрация | Авторизация
// ==================================================> --------------- <====================================================
require_once('../Connections/db.php'); // =======================================================> Подключаемся к бае-данных
session_start(); // ======================================================================================> Запускаем сессию
// =========================================================================================================================
// ============================================================================================================> Регистрация
if(isset($_POST['reg_ok'])){ // ==========================================================> Если нажато - Зарегистрироваться
    if($_POST['password'] != $_POST['password_2']){ // ===========================================> Если пароли не совпадают
        $_SESSION['msg'] = "Пароли не совпали!";} // ========================================================> Выдаём ошибку
        else{ // ========================================================================================> Иначе идём дальше
            if($_POST['name'] == '' || 
               $_POST['mail'] == '' || 
               $_POST['login'] == '' || 
               $_POST['password'] == ''){ // ==============================> Проверяем на заполнение [ * ] необходимых полей
                $_SESSION['msg'] = "Поля отмеченные * обязательны для заполнения!";} // => Если не заполнены - выдаём ошибку
            else{ // ====================================================================================> Иначе идём дальше
                $mail = $_POST['mail']; // ========================================================> Значение формы [ mail ]
                $login = $_POST['login']; // =====================================================> Значение формы [ login ]
                $sql_res = mysql_query("SELECT id FROM reg WHERE login='$login' OR mail='$mail'") or die(mysql_error());
                if(mysql_num_rows($sql_res) != 0 ){ // ======================> Если пользователь с такими данными существует
                    $_SESSION['msg'] = "Пользователь с таким логином и/или почтой уже существует!";
					header("location: ../regis/on_off.php"); exit; } // =====================================> Выдаем ошибку
                else{ // ===========================================================================> Если нет - идём дальше
                    $name = $_POST['name']; // ====================================================> Значение формы [ name ]
                    $mail = $_POST['mail']; // ====================================================> Значение формы [ mail ]
                    $login = $_POST['login']; // =================================================> Значение формы [ login ]
                    $password = $_POST['password']; // ========================================> Значение формы [ password ]
                    $telefon = $_POST['telefon']; // ===========================================> Значение формы [ telefon ]
                    $ip = $_SERVER['REMOTE_ADDR']; // ===============================================> ip адрес пользователя
                    mysql_query("INSERT INTO reg SET name='$name', 
                                                     mail='$mail', 
                                                     login='$login', 
                                                     password='$password', 
                                                     telefon='telefon', 
                                                     ip='$ip'"); // ===============================> Делаем запись в таблицу
                    // ================================================================================> Определяем новый id
                    $id = mysql_insert_id();
                    $sql_res = mysql_query("SELECT * FROM reg WHERE id=$id");
                    $arr = mysql_fetch_assoc($sql_res);			
                    $_SESSION['id'] = $arr['id']; // ===============================================> Сохраняем его в сессию
                    $id = $_SESSION['id']; // =============================================> Присваеваем id в переменную $id
                    $usr = mysql_fetch_assoc(mysql_query("SELECT * FROM reg WHERE id='$id'")); // =======> Забираем значение
                    header("location: ../regis/index.php"); exit; }}}} // ===============================> Выполняем переход
// =========================================================================================================> // Регистрация
// =========================================================================================================================
// ============================================================================================================> Авторизация
if(isset($_POST['avto_ok'])){ // ======================================================================> Если нажато - Войти
    $login = $_POST['login']; // =================================================================> Значение формы [ login ]
    $password = $_POST['password']; // ========================================================> Значение формы [ password ]
    $sql_res = mysql_query("SELECT * FROM reg WHERE login='$login'") or die(mysql_error()); // =============> Ищем в таблице
    if(mysql_num_rows($sql_res) != 0 ){ // ===============================================================> Если запись есть
        $arr = mysql_fetch_assoc($sql_res);
        if($arr['password'] === $password){ // ==================================================> Если пароль введён верный
            $_SESSION['id'] = $arr['id']; // ==============================================> Записываем значение id в сессию
            header("location: index.php"); exit; } // ===================================================> Выполняем переход
        else{ // ====================================================================================================> Иначе
            $_SESSION['msg'] = "Неверный логин и/или пароль!"; // =======================================> Выводим сообщение
			header("location: on_off.php"); exit; }}  // ================================================> Выполняем переход
            $_SESSION['msg'] = "Пользователь не найден!"; // ============================================> Выводим сообщение
			header("location: on_off.php"); exit; } // ==================================================> Выполняем переход
// =========================================================================================================> // Авторизация
// =========================================================================================================================
// =======================================================================> // Скрипт обработчик - Регистрация | Авторизация
// =========================================================================================================================
// =====================================================================================================================> ?>